import pylab
xlist = [100,200,300,400,500,600,700,800,900,1000,1100]
ylist1 = [10096, 73584, 295080, 740559, 1440205, 2419881, 4026656, 6050254, 11743242, 15299259, 16769229]
ylist2 = [4958, 38127, 143416, 371247, 725260, 1225766, 2055465, 3159489, 6186884, 8198448, 9097985]
ylist4 = [3154, 20419, 78110, 198368, 391454, 682984, 1193236, 1786995, 3803490, 4410352, 4845161]
ylist8 = [3085, 14612, 73925, 180969, 373418, 618025, 1038556, 1519762, 2818146, 4057969, 4336579]
ylist16 = [2820, 13163, 78957, 174302, 366733, 608470, 1061302, 1479830, 2669521, 3850097, 4428698]
ylist32 = [1710, 9722, 38184, 124120, 314297, 509392, 1026066, 1231968, 2512534, 3655710, 4167759]

pylab.xlabel('Размерность матрицы, символы')
pylab.ylabel('Время, микросекунды')
pylab.plot(xlist, ylist1, 'g^-', label = '1 поток')
pylab.plot(xlist, ylist2, 'bs-', label = '2 потока')
pylab.plot(xlist, ylist4, 'b-.', label = '4 потока')
pylab.plot(xlist, ylist8, 'g:', label = '8 потоков')
pylab.plot(xlist, ylist16, 'y-', label = '16 потоков')
pylab.plot(xlist, ylist32, 'r--', label = '32 потока')
pylab.legend(loc='upper left')
pylab.show()
